#+FILETAGS: :SEAS:

#+BEGIN: clocktable :scope file :maxlevel 2 :block thisweek
#+CAPTION: Clock summary at [2023-10-11 Wed 11:14], for week 2023-W41.
| Headline   | Time |
|------------+------|
| *Total time* | *0:00* |
#+END:

*** DONE Button for adding people to the mailing list.
CLOSED: [2023-07-03 Mon 14:04] SCHEDULED: <2023-06-29 Thu 13:00>
:LOGBOOK:
CLOCK: [2023-06-27 Tue 13:32]--[2023-06-27 Tue 14:08] =>  0:36
:END:
 [2023-06-27 Tue 12:37]

Stay in touch

- Blog
- Newsletter
- Podcast
- In-Person Events

*** HOLD  Look Book :Julie:HOLD:
:PROPERTIES:
:Effort:   2:00
:END:
:LOGBOOK:
- State "HOLD"       from "TODO"       [2023-09-06 Wed 13:49] \\
  Waiting till new year to do
- State "TODO"       from "WAITING"    [2023-08-06 Sun 23:03]
- State "WAITING"    from "TODO"       [2023-08-03 Thu 13:10] \\
  Waiting on Zack
- State "TODO"       from "WAITING"    [2023-08-01 Tue 21:05]
- State "WAITING"    from "NEXT"       [2023-07-28 Fri 13:37] \\
  Waiting for Zack and/or Sales
CLOCK: [2023-01-24 Tue 11:54]--[2023-01-24 Tue 12:28] =>  0:34
:END:
[2023-01-23 Mon 16:21]

**** DONE Make worflow for setting all new contacts as marketing contacts
CLOSED: [2023-05-17 Wed 14:56] SCHEDULED: <2023-05-17 Wed 15:00>
:PROPERTIES:
:Effort:   0:10
:END:
:LOGBOOK:
CLOCK: [2023-05-17 Wed 14:52]--[2023-05-17 Wed 14:56] =>  0:04
:END:
 [2023-05-17 Wed 14:27]
 [[file:~/Orgfiles/SEAS.org::*with Julie & Zack RE Phil Mershon Speaking Gig][with Julie & Zack RE Phil Mershon Speaking Gig]]

**** DONE Run through existing workflows and rename / organise
CLOSED: [2023-09-18 Mon 12:10] SCHEDULED: <2023-09-08 Fri>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2023-09-18 Mon 11:14]--[2023-09-18 Mon 12:10] =>  0:56
CLOCK: [2023-08-07 Mon 14:38]--[2023-08-07 Mon 15:55] =>  1:17
:END:

 [2023-06-27 Tue 09:47]

*** DONE Finish updates to Business Card
CLOSED: [2023-08-01 Tue 12:17] SCHEDULED: <2023-08-01 Tue 10:00>
:PROPERTIES:
:CATEGORY: Task
:Effort:   2:00
:END:
:LOGBOOK:
CLOCK: [2023-07-31 Mon 13:50]--[2023-07-31 Mon 16:23] =>  2:33
:END:
 [2023-07-31 Mon 11:37]

 Options:
 - Julie - 1 & 3
 - Tyler -  3 & 5

*** DONE Get AI print ready files together for AlphaPrint OS
CLOSED: [2023-08-01 Tue 15:47] SCHEDULED: <2023-08-01 Tue 14:30>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2023-08-01 Tue 12:58]--[2023-08-01 Tue 15:46] =>  2:48
:END:
 [2023-08-01 Tue 14:53]

*** DONE Create business cards for all variations
CLOSED: [2023-10-06 Fri 12:26] SCHEDULED: <2023-10-06 Fri 11:15>
:PROPERTIES:
:CATEGORY: Task
:Effort:   2:00
:END:
:LOGBOOK:
CLOCK: [2023-10-06 Fri 11:42]--[2023-10-06 Fri 12:26] =>  0:44
CLOCK: [2023-10-06 Fri 11:34]--[2023-10-06 Fri 11:41] =>  0:07
:END:
 [2023-10-06 Fri 11:15]
- [X] Troy
- [X] Jteff
- [X] Michael
- [X] Zack
- [X] Erica
- [X] Ruben
- [X] Kyle
- [X] Tyler
- [X] Craig
- [ ] Richard

- 500x
  - Zack
  - Troy
  - Michael
  - Jeff
  - Richard
- 100x
  - Tyler
  - Erica
  - Ruben
  - Kyle
  - Craig
  - Sean
  - 
    

*** DONE Create Page dedicated to podcast
CLOSED: [2023-09-19 Tue 14:47] SCHEDULED: <2023-09-19 Tue 11:00>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2023-09-19 Tue 10:53]--[2023-09-19 Tue 13:17] =>  2:24
:END:

 [2023-08-29 Tue 09:52]

*** DONE Upload Clint Bell Podcast
CLOSED: [2023-09-20 Wed 17:34] SCHEDULED: <2023-09-20 Wed 15:30>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2023-09-20 Wed 15:43]--[2023-09-20 Wed 17:34] =>  1:51
:END:
 [2023-09-20 Wed 13:21]

** TODO Clear Email
SCHEDULED: <2023-10-13 Fri .+1w>
:PROPERTIES:
:CATEGORY: Task
:LAST_REPEAT: [2023-10-06 Fri 12:54]
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2023-10-06 Fri 12:54]
- State "DONE"       from "TODO"       [2023-09-27 Wed 16:29]
- State "DONE"       from "TODO"       [2023-09-25 Mon 10:54]
- State "DONE"       from "TODO"       [2023-09-18 Mon 10:32]
CLOCK: [2023-09-18 Mon 09:26]--[2023-09-18 Mon 10:32] =>  1:06
:END:

 [2023-08-14 Mon 08:36]

** DONE Podcast Recording - Angelica Robison
CLOSED: [2023-09-08 Fri 10:53] SCHEDULED: <2023-09-08 Fri 10:00>
:PROPERTIES:
:CATEGORY: Task
:Effort:   1:00
:END:
:LOGBOOK:
CLOCK: [2023-09-08 Fri 09:53]--[2023-09-08 Fri 10:53] =>  1:00
:END:
 [2023-09-06 Wed 13:45]

**** DONE Edit Clint Bell Podcast Clips
CLOSED: [2023-09-18 Mon 14:31] SCHEDULED: <2023-09-18 Mon 13:45>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2023-09-18 Mon 13:43]--[2023-09-18 Mon 14:31] =>  0:48
:END:

[2023-09-06 Wed]

*** DONE Edit Tina Marie Podcast
CLOSED: [2023-09-08 Fri 15:11] SCHEDULED: <2023-09-08 Fri 12:30>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2023-09-08 Fri 12:33]--[2023-09-08 Fri 15:11] =>  2:38
:END:
 [2023-08-29 Tue 09:11]

*** DONE Transfer Angelica Robison Footage
CLOSED: [2023-09-08 Fri 16:30] SCHEDULED: <2023-09-08 Fri 15:10>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2023-09-08 Fri 15:11]--[2023-09-08 Fri 16:30] =>  1:19
:END:
 [2023-09-08 Fri 15:11]

*** TODO Edit Lasso Podcast
SCHEDULED: <2023-10-16 Mon 10:30>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2023-10-13 Fri 11:13]--[2023-10-13 Fri 14:09] =>  2:56
:END:
 [2023-10-11 Wed 11:19]


** DONE Transfer / Confirm footage from drives
CLOSED: [2023-09-27 Wed 11:21] SCHEDULED: <2023-09-20 Wed>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2023-09-20 Wed 13:59]--[2023-09-20 Wed 14:00] =>  0:01
:END:

 [2023-09-06 Wed 14:54]

** DONE Transfer Powur Footage
CLOSED: [2023-09-12 Tue 17:19] SCHEDULED: <2023-09-12 Tue>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2023-09-12 Tue 10:51]--[2023-09-12 Tue 11:51] =>  1:00
:END:
 [2023-09-12 Tue 10:37]

** DONE Plan the day/week
CLOSED: [2023-09-20 Wed 13:40] SCHEDULED: <2023-09-20 Wed 13:30>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2023-09-20 Wed 13:22]--[2023-09-20 Wed 13:40] =>  0:18
:END:
 [2023-09-20 Wed 13:22]

** DONE Setup Zapier  Hubspot -> Lasso mapping 
CLOSED: [2023-10-06 Fri 11:13] SCHEDULED: <2023-10-02 Mon 11:30>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2023-10-02 Mon 11:19]--[2023-10-02 Mon 15:25] =>  4:06
CLOCK: [2023-09-20 Wed 14:41]--[2023-09-20 Wed 15:43] =>  1:02
:END:
 [2023-09-20 Wed 13:35]

** DONE Help Ryan with Ap Install
CLOSED: [2023-09-25 Mon 16:37] SCHEDULED: <2023-09-25 Mon 12:00>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2023-09-25 Mon 13:00]--[2023-09-25 Mon 16:37] =>  3:37
:END:
 [2023-09-25 Mon 10:52]

** DONE Update Vendor Agreement documents on seas wbsite
CLOSED: [2023-09-27 Wed 11:30] SCHEDULED: <2023-09-27 Wed 11:21>
:LOGBOOK:
CLOCK: [2023-09-27 Wed 11:22]--[2023-09-27 Wed 11:30] =>  0:08
:END:

:PROPERTIES:
:CATEGORY: Task
:END:
 [2023-09-27 Wed 11:21]

** DONE Plan The Day
CLOSED: [2023-10-02 Mon 11:18] SCHEDULED: <2023-10-02 Mon 10:45>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2023-10-02 Mon 10:41]--[2023-10-02 Mon 11:18] =>  0:37
CLOCK: [2023-10-02 Mon 10:41]--[2023-10-02 Mon 10:41] =>  0:00
:END:
 [2023-10-01 Sun 23:58]

** DONE Transfer Files for Nick/Brandis (Sendlane)
CLOSED: [2023-10-06 Fri 17:07] SCHEDULED: <2023-10-06 Fri>
:PROPERTIES:
:CATEGORY: Task
:Effort:   0:30
:END:
:LOGBOOK:
CLOCK: [2023-10-06 Fri 14:47]--[2023-10-06 Fri 14:50] =>  0:03
CLOCK: [2023-10-06 Fri 12:34]--[2023-10-06 Fri 12:51] =>  0:17
:END:
 [2023-10-06 Fri 12:28]
- 974 GB free
** DONE Weekly Review & Planning 
CLOSED: [2023-10-06 Fri 13:29] SCHEDULED: <2023-10-06 Fri 13:00>
:PROPERTIES:
:CATEGORY: Task
:Effort:   0:30
:END:
:LOGBOOK:
CLOCK: [2023-10-06 Fri 12:57]--[2023-10-06 Fri 13:29] =>  0:32
:END:
 [2023-10-06 Fri 12:56]

** DONE Add previous month ebay sales in hubspot
CLOSED: [2023-10-06 Fri 15:15] SCHEDULED: <2023-10-06 Fri 15:10>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
- State "NEXT"       from "WAITING"    [2023-10-06 Fri 15:07]
CLOCK: [2023-10-06 Fri 15:07]--[2023-10-06 Fri 15:15] =>  0:08
- State "WAITING"    from "TODO"       [2023-10-06 Fri 13:33] \\
  Email sent to Justin. Waiting on reply with values
CLOCK: [2023-10-06 Fri 13:29]--[2023-10-06 Fri 13:34] =>  0:05
:END:
 [2023-10-06 Fri 13:24]
 - June?
 - Aug
 - Sep

** DONE Clean up meeting notes and save on google drive. 
CLOSED: [2023-10-06 Fri 14:04] SCHEDULED: <2023-10-06 Fri 13:35>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2023-10-06 Fri 13:35]--[2023-10-06 Fri 14:04] =>  0:29
:END:
 [2023-10-06 Fri 13:33]

** DONE Create an auto-play for the vimeo video for flyer
CLOSED: [2023-10-11 Wed 12:09] SCHEDULED: <2023-10-11 Wed 11:30>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2023-10-11 Wed 11:28]--[2023-10-11 Wed 12:09] =>  0:41
:END:
 [2023-10-10 Tue 15:12]
*

** DONE Transfer Customer Care Footage
CLOSED: [2023-10-11 Wed 12:55]
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2023-10-11 Wed 12:14]--[2023-10-11 Wed 12:20] =>  0:06
:END:
 [2023-10-11 Wed 12:14]

** MEETING with Marketing Team :MEETING:
:LOGBOOK:
CLOCK: [2023-09-06 Wed 09:59]--[2023-09-06 Wed 11:17] =>  1:18
:END:
[2023-09-06 Wed 09:59]

** MEETING with Ryan - IT Updates :MEETING:
:LOGBOOK:
CLOCK: [2023-09-11 Mon 10:55]--[2023-09-11 Mon 11:26] =>  0:31
:END:
[2023-09-11 Mon 11:25]

** MEETING with  Marketing Meeting                                 :MEETING:
:LOGBOOK:
CLOCK: [2023-09-13 Wed 09:59]--[2023-09-13 Wed 10:58] =>  0:59
:END:
[2023-09-13 Wed 09:58]
** MEETING with Marketing                                          :MEETING:
:LOGBOOK:
CLOCK: [2023-09-20 Wed 10:00]--[2023-09-20 Wed 11:13] =>  1:13
:END:
[2023-09-20 Wed 09:59]

** MEETING with Lasso (zoom)                                       :MEETING:
:LOGBOOK:
CLOCK: [2023-09-14 Thu 13:00]--[2023-09-14 Thu 13:28] =>  0:28
:END:
[2023-09-14 Thu 13:00]

Went through lasso setup and got zapier connection operational. Need to finish up proper data connections
** MEETING with Jeff (random google meet)                          :MEETING:
:LOGBOOK:
CLOCK: [2023-09-20 Wed 14:19]--[2023-09-20 Wed 14:40] =>  0:21
:END:
[2023-09-20 Wed 14:19]
** MEETING with Managers Meeting                                   :MEETING:
:LOGBOOK:
CLOCK: [2023-09-21 Thu 11:18]--[2023-09-21 Thu 12:12] =>  0:54
:END:
[2023-09-21 Thu 11:18]
** MEETING with Weekly Marketing Meeting                           :MEETING:
:LOGBOOK:
CLOCK: [2023-09-27 Wed 12:55]--[2023-09-27 Wed 13:40] =>  0:45
:END:
[2023-09-27 Wed 12:55]

** MEETING with 10/4/23 Marketing Meeting                          :MEETING:
:LOGBOOK:
CLOCK: [2023-10-04 Wed 12:55]--[2023-10-04 Wed 14:35] =>  1:40
:END:
[2023-10-04 Wed 12:55]
** MEETING with 10/11/2023 Marketing Meeting                       :MEETING:
:LOGBOOK:
CLOCK: [2023-10-11 Wed 12:57]--[2023-10-11 Wed 13:38] =>  0:41
:END:
[2023-10-11 Wed 12:57]
*** Break Time
:LOGBOOK:
CLOCK: [2023-10-06 Fri 14:15]--[2023-10-06 Fri 14:33] =>  0:18

:END:
